app/controllers/reminders_controller.rb

  def index
    # Obtain all reminders in database
    @reminders = Reminder.all
---
SELECT "reminders".* FROM "reminders"

  def show
    # Change URL to show specific post
    @reminder = Reminder.find(params[:id])
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @reminder = Reminder.new(params[:reminder])

    # Boolean || ModelMailer.new_notification
    if @reminder.save
---
INSERT INTO "reminders" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["created_at", Sun, 13 Apr 2014 02:30:18 UTC +00:00], ["title", ""], ["updated_at", Sun, 13 Apr 2014 02:30:18 UTC +00:00]]

  def edit
    @reminder = Reminder.find(params[:id])
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    # used by edit
    @reminder = Reminder.find(params[:id])

    if @reminder.update_attributes(params[:reminder])
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "reminders" SET "content" = ?, "updated_at" = ? WHERE "reminders"."id" = 3  [["content", "Buy more food soon"], ["updated_at", Sun, 13 Apr 2014 02:41:52 UTC +00:00]]

  def destroy
    @reminder = Reminder.find(params[:id])
    @reminder.destroy
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "reminders" WHERE "reminders"."id" = ?  [["id", 4]]